{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "fd2f4fa6-11e4-4ed1-b734-215a9351385c",
   "metadata": {},
   "outputs": [],
   "source": [
    "%load_ext dotenv\n",
    "%dotenv"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "eb5cd849-5b12-44fe-932b-66f15898d561",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/Users/tomazbratanic/anaconda3/lib/python3.11/site-packages/pandas/core/arrays/masked.py:60: UserWarning: Pandas requires version '1.3.6' or newer of 'bottleneck' (version '1.3.5' currently installed).\n",
      "  from pandas.core import (\n",
      "/Users/tomazbratanic/anaconda3/lib/python3.11/site-packages/pydantic/_internal/_fields.py:132: UserWarning: Field \"model_name\" in _VertexAIBase has conflict with protected namespace \"model_\".\n",
      "\n",
      "You may be able to resolve this warning by setting `model_config['protected_namespaces'] = ()`.\n",
      "  warnings.warn(\n",
      "/Users/tomazbratanic/anaconda3/lib/python3.11/site-packages/pydantic/_internal/_fields.py:132: UserWarning: Field \"model_name\" in _VertexAICommon has conflict with protected namespace \"model_\".\n",
      "\n",
      "You may be able to resolve this warning by setting `model_config['protected_namespaces'] = ()`.\n",
      "  warnings.warn(\n"
     ]
    }
   ],
   "source": [
    "from datetime import datetime\n",
    "import pandas as pd\n",
    "from ch07_tools import get_answer\n",
    "from datasets import Dataset\n",
    "from ragas import evaluate\n",
    "from ragas.metrics import (\n",
    "    answer_correctness,\n",
    "    context_recall,\n",
    "    faithfulness,\n",
    ")\n",
    "\n",
    "\n",
    "from tqdm import tqdm\n",
    "from utils import neo4j_driver\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "f7917c60-279d-4fcf-ad6a-f2a379a6bde7",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "('The actor who acted in the most movies is Tom Hanks, with a movie count of 12.',\n",
       " [{'role': 'assistant',\n",
       "   'content': 'For the question: \\'Which actor has acted in the most movies?\\', we have the answer: \\'[[{\"actor\": \"Tom Hanks\", \"movie_count\": 12}]]\\''},\n",
       "  {'role': 'assistant',\n",
       "   'content': 'For the question: \\'Who is the actor with the highest number of movie roles?\\', we have the answer: \\'[[{\"actor\": \"Tom Hanks\", \"roles_count\": 12}]]\\''}])"
      ]
     },
     "execution_count": 3,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "get_answer(\"Who acted in the most movies?\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "96ae8eca-d935-4897-8382-d1030401f0e9",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>question</th>\n",
       "      <th>cypher</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Hello</td>\n",
       "      <td>RETURN \"greeting and reminder it can only answ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>What can you do?</td>\n",
       "      <td>RETURN \"answer questions related to movies and...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>How many movies are there?</td>\n",
       "      <td>MATCH (m:Movie) RETURN count(*) AS movies</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Who acted in the most movies?</td>\n",
       "      <td>MATCH (p:Person)-[:ACTED_IN]-&gt;(m:Movie)\\nRETUR...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Which movies released between 1990 and 2000 ha...</td>\n",
       "      <td>MATCH (m:Movie) WHERE m.released &gt;= 1990 AND m...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Who has the longest name among all actors?</td>\n",
       "      <td>MATCH (p:Person)-[:ACTED_IN]-&gt;(:Movie) RETURN ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>List people born before 1940.</td>\n",
       "      <td>MATCH (p:Person) WHERE p.born &lt; 1940 RETURN p....</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Who was born in 1965 and has directed a movie?</td>\n",
       "      <td>MATCH (p:Person)-[:DIRECTED]-&gt;(m:Movie) WHERE ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Who acted in Top Gun?</td>\n",
       "      <td>MATCH (p:Person)-[:ACTED_IN]-&gt;(m:Movie {title:...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>List the movies with a title starting with \"The\"</td>\n",
       "      <td>MATCH (m:Movie) WHERE m.title STARTS WITH \"The...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>How many movies did Tom Hanks appear in?</td>\n",
       "      <td>MATCH (p:Person {name: \"Tom Hanks\"})-[:ACTED_I...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>Who played in the Matrix?</td>\n",
       "      <td>MATCH (p:Person)-[:ACTED_IN]-&gt;(m:Movie {title:...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>Which movie has the most Oscars?</td>\n",
       "      <td>RETURN \"This information is missing\"</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                             question  \\\n",
       "0                                               Hello   \n",
       "1                                    What can you do?   \n",
       "2                          How many movies are there?   \n",
       "3                       Who acted in the most movies?   \n",
       "4   Which movies released between 1990 and 2000 ha...   \n",
       "5          Who has the longest name among all actors?   \n",
       "6                       List people born before 1940.   \n",
       "7      Who was born in 1965 and has directed a movie?   \n",
       "8                               Who acted in Top Gun?   \n",
       "9    List the movies with a title starting with \"The\"   \n",
       "10           How many movies did Tom Hanks appear in?   \n",
       "11                          Who played in the Matrix?   \n",
       "12                   Which movie has the most Oscars?   \n",
       "\n",
       "                                               cypher  \n",
       "0   RETURN \"greeting and reminder it can only answ...  \n",
       "1   RETURN \"answer questions related to movies and...  \n",
       "2           MATCH (m:Movie) RETURN count(*) AS movies  \n",
       "3   MATCH (p:Person)-[:ACTED_IN]->(m:Movie)\\nRETUR...  \n",
       "4   MATCH (m:Movie) WHERE m.released >= 1990 AND m...  \n",
       "5   MATCH (p:Person)-[:ACTED_IN]->(:Movie) RETURN ...  \n",
       "6   MATCH (p:Person) WHERE p.born < 1940 RETURN p....  \n",
       "7   MATCH (p:Person)-[:DIRECTED]->(m:Movie) WHERE ...  \n",
       "8   MATCH (p:Person)-[:ACTED_IN]->(m:Movie {title:...  \n",
       "9   MATCH (m:Movie) WHERE m.title STARTS WITH \"The...  \n",
       "10  MATCH (p:Person {name: \"Tom Hanks\"})-[:ACTED_I...  \n",
       "11  MATCH (p:Person)-[:ACTED_IN]->(m:Movie {title:...  \n",
       "12               RETURN \"This information is missing\"  "
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "test_data = pd.read_csv(\"../data/benchmark_data.csv\", delimiter=\";\")\n",
    "test_data"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "071f082d-52d6-4e26-b158-52df8af1a670",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Processing rows: 100%|██████████| 13/13 [03:20<00:00, 15.45s/it]\n"
     ]
    }
   ],
   "source": [
    "answers = []\n",
    "ground_truths = []\n",
    "latencies = []\n",
    "contexts = []\n",
    "\n",
    "for i, row in tqdm(test_data.iterrows(), total=len(test_data), desc=\"Processing rows\"):\n",
    "    ground_truth, _, _ = neo4j_driver.execute_query(row[\"cypher\"])\n",
    "    ground_truths.append([str(el.data()) for el in ground_truth])\n",
    "    start = datetime.now()\n",
    "    try:\n",
    "        answer, context = get_answer(row[\"question\"])\n",
    "        context = [el['content'] for el in context]\n",
    "    except Exception:\n",
    "        answer, context = None, []\n",
    "    latencies.append((datetime.now() - start).total_seconds())\n",
    "    answers.append(answer)\n",
    "    contexts.append(context)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "e98b4096-1740-4892-a43d-dc5fbceb149d",
   "metadata": {},
   "outputs": [],
   "source": [
    "test_data['ground_truth'] = [str(el) for el in ground_truths]\n",
    "test_data['answer'] = answers\n",
    "test_data['latency'] = latencies\n",
    "test_data['retrieved_contexts'] = contexts"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "c4ba84fe-e23a-48b0-adeb-6942ed3fdaa5",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "13305ef950db4620b2266baa4706d581",
       "version_major": 2,
       "version_minor": 0
      },
      "text/plain": [
       "Evaluating:   0%|          | 0/39 [00:00<?, ?it/s]"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'answer_correctness': 0.7153, 'context_recall': 0.6923, 'faithfulness': 1.0000}\n"
     ]
    }
   ],
   "source": [
    "dataset = Dataset.from_pandas(test_data.fillna(\"I don't know\"))\n",
    "result = evaluate(\n",
    "    dataset,\n",
    "    metrics=[\n",
    "        answer_correctness,\n",
    "        context_recall,\n",
    "        faithfulness,\n",
    "    ],\n",
    ")\n",
    "print(result)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "61e5598b-26e1-4113-a1e6-0c24ddd9743d",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>question</th>\n",
       "      <th>cypher</th>\n",
       "      <th>ground_truth</th>\n",
       "      <th>answer</th>\n",
       "      <th>latency</th>\n",
       "      <th>retrieved_contexts</th>\n",
       "      <th>answer_correctness</th>\n",
       "      <th>context_recall</th>\n",
       "      <th>faithfulness</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Hello</td>\n",
       "      <td>RETURN \"greeting and reminder it can only answ...</td>\n",
       "      <td>['{\\'\"greeting and reminder it can only answer...</td>\n",
       "      <td>I can only answer questions about movies and t...</td>\n",
       "      <td>5.876216</td>\n",
       "      <td>[For the question: 'Which actor has acted in t...</td>\n",
       "      <td>0.196927</td>\n",
       "      <td>0.0</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>What can you do?</td>\n",
       "      <td>RETURN \"answer questions related to movies and...</td>\n",
       "      <td>['{\\'\"answer questions related to movies and t...</td>\n",
       "      <td>I can provide information about movies and the...</td>\n",
       "      <td>9.577331</td>\n",
       "      <td>[For the question: 'Which actor has acted in t...</td>\n",
       "      <td>0.702383</td>\n",
       "      <td>0.0</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>How many movies are there?</td>\n",
       "      <td>MATCH (m:Movie) RETURN count(*) AS movies</td>\n",
       "      <td>[\"{'movies': 38}\"]</td>\n",
       "      <td>There are 38 movies in total.</td>\n",
       "      <td>12.843184</td>\n",
       "      <td>[For the question: 'Which actor has acted in t...</td>\n",
       "      <td>0.957427</td>\n",
       "      <td>1.0</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Who acted in the most movies?</td>\n",
       "      <td>MATCH (p:Person)-[:ACTED_IN]-&gt;(m:Movie)\\nRETUR...</td>\n",
       "      <td>[\"{'p.name': 'Tom Hanks', 'movieCount': 12}\"]</td>\n",
       "      <td>The actor who has acted in the most movies is ...</td>\n",
       "      <td>22.990381</td>\n",
       "      <td>[For the question: 'Which actor has acted in t...</td>\n",
       "      <td>0.701865</td>\n",
       "      <td>1.0</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Which movies released between 1990 and 2000 ha...</td>\n",
       "      <td>MATCH (m:Movie) WHERE m.released &gt;= 1990 AND m...</td>\n",
       "      <td>[\"{'m.title': 'The Matrix', 'm.released': 1999...</td>\n",
       "      <td>The movie released between 1990 and 2000 that ...</td>\n",
       "      <td>64.656445</td>\n",
       "      <td>[For the question: 'Which actor has acted in t...</td>\n",
       "      <td>0.944827</td>\n",
       "      <td>1.0</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Who has the longest name among all actors?</td>\n",
       "      <td>MATCH (p:Person)-[:ACTED_IN]-&gt;(:Movie) RETURN ...</td>\n",
       "      <td>[\"{'name': 'Philip Seymour Hoffman'}\"]</td>\n",
       "      <td>The information needed to answer the question ...</td>\n",
       "      <td>11.923005</td>\n",
       "      <td>[For the question: 'Which actor has acted in t...</td>\n",
       "      <td>0.183914</td>\n",
       "      <td>0.0</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>List people born before 1940.</td>\n",
       "      <td>MATCH (p:Person) WHERE p.born &lt; 1940 RETURN p....</td>\n",
       "      <td>[\"{'p.name': 'Max von Sydow'}\", \"{'p.name': 'G...</td>\n",
       "      <td>The people born before 1940 are:\\n\\n- Max von ...</td>\n",
       "      <td>7.005498</td>\n",
       "      <td>[For the question: 'Which actor has acted in t...</td>\n",
       "      <td>0.947563</td>\n",
       "      <td>1.0</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Who was born in 1965 and has directed a movie?</td>\n",
       "      <td>MATCH (p:Person)-[:DIRECTED]-&gt;(m:Movie) WHERE ...</td>\n",
       "      <td>[\"{'p.name': 'Lana Wachowski'}\", \"{'p.name': '...</td>\n",
       "      <td>The information provided does not specify whic...</td>\n",
       "      <td>10.669961</td>\n",
       "      <td>[For the question: 'Which actor has acted in t...</td>\n",
       "      <td>0.179119</td>\n",
       "      <td>1.0</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Who acted in Top Gun?</td>\n",
       "      <td>MATCH (p:Person)-[:ACTED_IN]-&gt;(m:Movie {title:...</td>\n",
       "      <td>[\"{'p.name': 'Val Kilmer'}\", \"{'p.name': 'Meg ...</td>\n",
       "      <td>The actors who acted in \"Top Gun\" are Val Kilm...</td>\n",
       "      <td>3.962218</td>\n",
       "      <td>[For the question: 'Which actor has acted in t...</td>\n",
       "      <td>0.950264</td>\n",
       "      <td>1.0</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>List the movies with a title starting with \"The\"</td>\n",
       "      <td>MATCH (m:Movie) WHERE m.title STARTS WITH \"The...</td>\n",
       "      <td>[\"{'m.title': 'The Birdcage'}\", \"{'m.title': '...</td>\n",
       "      <td>The movies with a title starting with \"The\" ar...</td>\n",
       "      <td>9.150836</td>\n",
       "      <td>[For the question: 'Which actor has acted in t...</td>\n",
       "      <td>0.953924</td>\n",
       "      <td>1.0</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>How many movies did Tom Hanks appear in?</td>\n",
       "      <td>MATCH (p:Person {name: \"Tom Hanks\"})-[:ACTED_I...</td>\n",
       "      <td>[\"{'numberOfMovies': 12}\"]</td>\n",
       "      <td>Tom Hanks appeared in 12 movies.</td>\n",
       "      <td>21.107865</td>\n",
       "      <td>[For the question: 'Which actor has acted in t...</td>\n",
       "      <td>0.947381</td>\n",
       "      <td>1.0</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>Who played in the Matrix?</td>\n",
       "      <td>MATCH (p:Person)-[:ACTED_IN]-&gt;(m:Movie {title:...</td>\n",
       "      <td>[\"{'p.name': 'Emil Eifrem'}\", \"{'p.name': 'Hug...</td>\n",
       "      <td>The actors who played in \"The Matrix\" are Kean...</td>\n",
       "      <td>5.517562</td>\n",
       "      <td>[For the question: 'Which actor has acted in t...</td>\n",
       "      <td>0.942441</td>\n",
       "      <td>1.0</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>Which movie has the most Oscars?</td>\n",
       "      <td>RETURN \"This information is missing\"</td>\n",
       "      <td>['{\\'\"This information is missing\"\\': \\'This i...</td>\n",
       "      <td>The information about which movie has the most...</td>\n",
       "      <td>10.875722</td>\n",
       "      <td>[For the question: 'Which actor has acted in t...</td>\n",
       "      <td>0.690648</td>\n",
       "      <td>0.0</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                             question  \\\n",
       "0                                               Hello   \n",
       "1                                    What can you do?   \n",
       "2                          How many movies are there?   \n",
       "3                       Who acted in the most movies?   \n",
       "4   Which movies released between 1990 and 2000 ha...   \n",
       "5          Who has the longest name among all actors?   \n",
       "6                       List people born before 1940.   \n",
       "7      Who was born in 1965 and has directed a movie?   \n",
       "8                               Who acted in Top Gun?   \n",
       "9    List the movies with a title starting with \"The\"   \n",
       "10           How many movies did Tom Hanks appear in?   \n",
       "11                          Who played in the Matrix?   \n",
       "12                   Which movie has the most Oscars?   \n",
       "\n",
       "                                               cypher  \\\n",
       "0   RETURN \"greeting and reminder it can only answ...   \n",
       "1   RETURN \"answer questions related to movies and...   \n",
       "2           MATCH (m:Movie) RETURN count(*) AS movies   \n",
       "3   MATCH (p:Person)-[:ACTED_IN]->(m:Movie)\\nRETUR...   \n",
       "4   MATCH (m:Movie) WHERE m.released >= 1990 AND m...   \n",
       "5   MATCH (p:Person)-[:ACTED_IN]->(:Movie) RETURN ...   \n",
       "6   MATCH (p:Person) WHERE p.born < 1940 RETURN p....   \n",
       "7   MATCH (p:Person)-[:DIRECTED]->(m:Movie) WHERE ...   \n",
       "8   MATCH (p:Person)-[:ACTED_IN]->(m:Movie {title:...   \n",
       "9   MATCH (m:Movie) WHERE m.title STARTS WITH \"The...   \n",
       "10  MATCH (p:Person {name: \"Tom Hanks\"})-[:ACTED_I...   \n",
       "11  MATCH (p:Person)-[:ACTED_IN]->(m:Movie {title:...   \n",
       "12               RETURN \"This information is missing\"   \n",
       "\n",
       "                                         ground_truth  \\\n",
       "0   ['{\\'\"greeting and reminder it can only answer...   \n",
       "1   ['{\\'\"answer questions related to movies and t...   \n",
       "2                                  [\"{'movies': 38}\"]   \n",
       "3       [\"{'p.name': 'Tom Hanks', 'movieCount': 12}\"]   \n",
       "4   [\"{'m.title': 'The Matrix', 'm.released': 1999...   \n",
       "5              [\"{'name': 'Philip Seymour Hoffman'}\"]   \n",
       "6   [\"{'p.name': 'Max von Sydow'}\", \"{'p.name': 'G...   \n",
       "7   [\"{'p.name': 'Lana Wachowski'}\", \"{'p.name': '...   \n",
       "8   [\"{'p.name': 'Val Kilmer'}\", \"{'p.name': 'Meg ...   \n",
       "9   [\"{'m.title': 'The Birdcage'}\", \"{'m.title': '...   \n",
       "10                         [\"{'numberOfMovies': 12}\"]   \n",
       "11  [\"{'p.name': 'Emil Eifrem'}\", \"{'p.name': 'Hug...   \n",
       "12  ['{\\'\"This information is missing\"\\': \\'This i...   \n",
       "\n",
       "                                               answer    latency  \\\n",
       "0   I can only answer questions about movies and t...   5.876216   \n",
       "1   I can provide information about movies and the...   9.577331   \n",
       "2                       There are 38 movies in total.  12.843184   \n",
       "3   The actor who has acted in the most movies is ...  22.990381   \n",
       "4   The movie released between 1990 and 2000 that ...  64.656445   \n",
       "5   The information needed to answer the question ...  11.923005   \n",
       "6   The people born before 1940 are:\\n\\n- Max von ...   7.005498   \n",
       "7   The information provided does not specify whic...  10.669961   \n",
       "8   The actors who acted in \"Top Gun\" are Val Kilm...   3.962218   \n",
       "9   The movies with a title starting with \"The\" ar...   9.150836   \n",
       "10                   Tom Hanks appeared in 12 movies.  21.107865   \n",
       "11  The actors who played in \"The Matrix\" are Kean...   5.517562   \n",
       "12  The information about which movie has the most...  10.875722   \n",
       "\n",
       "                                   retrieved_contexts  answer_correctness  \\\n",
       "0   [For the question: 'Which actor has acted in t...            0.196927   \n",
       "1   [For the question: 'Which actor has acted in t...            0.702383   \n",
       "2   [For the question: 'Which actor has acted in t...            0.957427   \n",
       "3   [For the question: 'Which actor has acted in t...            0.701865   \n",
       "4   [For the question: 'Which actor has acted in t...            0.944827   \n",
       "5   [For the question: 'Which actor has acted in t...            0.183914   \n",
       "6   [For the question: 'Which actor has acted in t...            0.947563   \n",
       "7   [For the question: 'Which actor has acted in t...            0.179119   \n",
       "8   [For the question: 'Which actor has acted in t...            0.950264   \n",
       "9   [For the question: 'Which actor has acted in t...            0.953924   \n",
       "10  [For the question: 'Which actor has acted in t...            0.947381   \n",
       "11  [For the question: 'Which actor has acted in t...            0.942441   \n",
       "12  [For the question: 'Which actor has acted in t...            0.690648   \n",
       "\n",
       "    context_recall  faithfulness  \n",
       "0              0.0           1.0  \n",
       "1              0.0           1.0  \n",
       "2              1.0           1.0  \n",
       "3              1.0           1.0  \n",
       "4              1.0           1.0  \n",
       "5              0.0           1.0  \n",
       "6              1.0           1.0  \n",
       "7              1.0           1.0  \n",
       "8              1.0           1.0  \n",
       "9              1.0           1.0  \n",
       "10             1.0           1.0  \n",
       "11             1.0           1.0  \n",
       "12             0.0           1.0  "
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "for key in [\"answer_correctness\", \"context_recall\", \"faithfulness\"]:\n",
    "    test_data[key] = [el[key] for el in result.scores]\n",
    "test_data"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "3997a6dc-1e66-4435-afcf-7b48014507f2",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.5"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
